axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_rtc.c
    /* Reset INTSTS register and exit initialization mode */
    RTC->INITSTS = (uint32_t)0x00000000;
}

/**
*\*\name    RTC_Deinitializes.
*\*\fun     Deinitializes the RTC registers to their default reset values.
*\*\return  ErrorStatus
*\*\            - SUCCESS: RTC registers are deinitialized
*\*\            - ERROR: RTC registers are not deinitialized
*\*\
**/
ErrorStatus RTC_Deinitializes(void)
{
    uint32_t temp_value = 0x00;
    uint32_t temp_value1 = 0x00;
    ErrorStatus status_value = ERROR;

    /* Disable the write protection for RTC registers */
    RTC_Write_Protection_Disable();

    /* Set Initialization mode */
    if (RTC_Initialization_Mode_Enter() == ERROR)
    {
        status_value = ERROR;
    }
    else
    {
        /* Reset TSH, DAT and CTRL registers */
        RTC->TSH  = (uint32_t)0x00000000;
        RTC->DATE = (uint32_t)0x00002101;

        /* Reset All CTRL bits except CTRL[2:0] */
        RTC->CTRL &= RTC_CTRL_WKUPSEL;

        /* Wait till RTC WTWF flag is set and if Time out is reached exit */
        do
        {
            temp_value1 = RTC->INITSTS & RTC_FLAG_WTWF;
            temp_value++;
        } while ((temp_value != INITMODE_TIMEOUT) && (temp_value1 == 0x00));

        if ((RTC->INITSTS & RTC_FLAG_WTWF) == RESET)
        {
            status_value = ERROR;
        }
        else
        {
            RTC_Registers_Reset();
            /* Wait till the RTC RSYF flag is set */
            if (RTC_Wait_For_Synchronization() == ERROR)
            {
                status_value = ERROR;
            }
            else
            {
                status_value = SUCCESS;
            }
        }
    }

    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();

    return status_value;
}

/**
*\*\name    RTC_Wait_For_Resynchronization.
*\*\fun     Waits until the RTC Time and Date registers (RTC_TSH and RTC_DATE) are synchronized with RTC APB clock.
*\*\return  ErrorStatus :
*\*\            - SUCCESS:  RTC registers are synchronised
*\*\            - ERROR:    RTC registers are not synchronised
**/
ErrorStatus RTC_Wait_For_Synchronization(void)
{
    uint32_t temp_value = 0;    
    uint32_t temp_value1 = 0x00;
    ErrorStatus status_value = ERROR;

    /* Disable the write protection for RTC registers */
    RTC_Write_Protection_Disable();

    /* Clear RSYF flag */
    RTC->INITSTS &= (uint32_t)RTC_RSF_MASK;

    /* Wait the registers to be synchronised */
    do
    {
        temp_value1 = RTC->INITSTS & RTC_FLAG_RSYF;
        temp_value++;
    } while ((temp_value != SYNCHRO_TIMEOUT) && (temp_value1 == 0x00));

    if ((RTC->INITSTS & RTC_FLAG_RSYF) != RESET)
    {
        status_value = SUCCESS;
    }
    else
    {
        status_value = ERROR;
    }

    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();

    return status_value;
}

/**
*\*\name    RTC_Reference_Clock_Enable.
*\*\fun     Enables the RTC reference clock detection.
*\*\param   none
*\*\return  none 
**/
ErrorStatus RTC_Reference_Clock_Enable(void)
{
    ErrorStatus status_value = ERROR;

    /* Disable the write protection for RTC registers */
    RTC_Write_Protection_Disable();

    /* Set Initialization mode */
    if (RTC_Initialization_Mode_Enter() == ERROR)
    {
        status_value = ERROR;
    }
    else
    {
        /* Enable the RTC reference clock detection */
        RTC->CTRL |= RTC_REFERENCE_DETECT_ENABLE;

        /* Exit Initialization mode */
        RTC_Initialization_Mode_Exit();

        status_value = SUCCESS;
    }

    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();

    return status_value;
}


/**
*\*\name    RTC_Reference_Clock_Disable.
*\*\fun     Disables the RTC reference clock detection.
*\*\param   none
*\*\return  none 
**/
ErrorStatus RTC_Reference_Clock_Disable(void)
{
    ErrorStatus status_value = ERROR;

    /* Disable the write protection for RTC registers */
    RTC_Write_Protection_Disable();

    /* Set Initialization mode */
    if (RTC_Initialization_Mode_Enter() == ERROR)
    {
        status_value = ERROR;
    }
    else
    {
        /* Disable the RTC reference clock detection */
        RTC->CTRL &= ~RTC_REFERENCE_DETECT_ENABLE;

        /* Exit Initialization mode */
        RTC_Initialization_Mode_Exit();

        status_value = SUCCESS;
    }

    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();

    return status_value;
}

/**
*\*\name    RTC_By_Pass_Shadow_Enable.
*\*\fun     Calendar value read from Calendar register.
*\*\param   none
*\*\return  none 
**/
void RTC_Bypass_Shadow_Enable(void)
{
    /* Disable the write protection for RTC registers */
    RTC_Write_Protection_Disable();

    /* Set the BYPS bit */
    RTC->CTRL |= (uint8_t)RTC_BYPASS_UPDATE;
    
    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();
}

/**
*\*\name    RTC_By_Pass_Shadow_Disable.
*\*\fun     Calendar value read from Shadow register.
*\*\param   none
*\*\return  none 
**/
void RTC_Bypass_Shadow_Disable(void)
{
    /* Disable the write protection for RTC registers */
    RTC_Write_Protection_Disable();

    /* Reset the BYPS bit */
    RTC->CTRL &= (uint8_t)~RTC_BYPASS_UPDATE;

    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();
}

/**
*\*\name    RTC_Time_Struct_Initializes.
*\*\fun     Fills each RTC_TimeStruct member with its default value
*\*\        (Time = 00h:00min:00sec).
*\*\param   RTC_TimeStruct : RTC_TimeStruct pointer to a RTC_TimeType structure that contains
*\*\                         the time configuration information for the RTC.
*\*\            - Hours
*\*\                - if RTC_AM_H12 is select the value in the 0-23 range
*\*\                - if RTC_PM_H12 is select the value in the 1-12 range
*\*\            - Minutes  the value set in the 0-59 range
*\*\            - Seconds  the value set in the 0-59 range
*\*\            - H12
*\*\                - RTC_AM_H12
*\*\                - RTC_PM_H12
*\*\return  none 
**/
void RTC_Time_Struct_Initializes(RTC_TimeType* RTC_TimeStruct)
{
    /* Time = 00h:00min:00sec */
    RTC_TimeStruct->H12     = RTC_AM_H12;
    RTC_TimeStruct->Hours   = 0;
    RTC_TimeStruct->Minutes = 0;
    RTC_TimeStruct->Seconds = 0;
}

/**
*\*\name    RTC_Time_Get.
*\*\fun     Get the RTC current Time.
*\*\param   RTC_Format : specifies the format of the returned parameters.
*\*\            - RTC_FORMAT_BIN 
*\*\            - RTC_FORMAT_BCD 
*\*\param   RTC_TimeStruct : RTC_TimeStruct pointer to a RTC_TimeType structure.
*\*\return  none 
**/
void RTC_Time_Get(uint32_t RTC_Format, RTC_TimeType* RTC_TimeStruct)
{
    uint32_t temp_value = 0;

